{
  "www.w3schools.com": {
    "url": "https://www.w3schools.com/tryit/tryit.asp?filename=tryhtml_hello",
    "implementation_details": "Run ❯\nGet your\nown\nwebsite\n×\nChange Orientation\nSave Code\nChange Theme, Dark/Light\nGo to Spaces\nHello World!\nThis is a paragraph."
  },
  "codepen.io": {
    "url": "https://codepen.io/pen/",
    "implementation_details": "HTML preprocessors can make writing HTML more powerful or convenient. For instance, Markdown is designed to be easier to write and read for text documents and you could write a loop in Pug.\nIn CodePen, whatever you write in the HTML editor is what goes within the <body>\ntags in a basic HTML5 template. So you don't have access to higher-up elements like the <html>\ntag. If you want to add classes there that can affect the whole document, this is the place to do it.\nIn CodePen, whatever you write in the HTML editor is what goes within the <body>\ntags in a basic HTML5 template. If you need things in the <head>\nof the document, put that code here.\nThe resource you are linking to is using the 'http' protocol, which may not work when the browser is using https.\nCSS preprocessors help make authoring CSS easier. All of them offer things like variables and mixins to provide convenient abstractions.\nIt's a common practice to apply CSS to a page that styles elements such that they are consistent across all browsers. We offer two of the most popular choices: normalize.css and a reset. Or, choose Neither and nothing will be applied.\nTo get the best cross-browser support, it is a common practice to apply vendor prefixes to CSS properties and values that require them to work. For instance -webkit-\nor -moz-\n.\nWe offer two popular choices: Autoprefixer (which processes your CSS server-side) and -prefix-free (which applies prefixes via a script, client-side).\nAny URLs added here will be added as <link>\ns in order, and before the CSS in the editor. You can use the CSS from another Pen by using its URL and the proper URL extension.\nYou can apply CSS to your Pen from any stylesheet on the web. Just put a URL to it here and we'll apply it, in the order you have them, before the CSS in the Pen itself.\nYou can also link to another Pen here (use the .css\nURL Extension) and we'll pull the CSS from that Pen and include it. If it's using a matching preprocessor, use the appropriate URL Extension and we'll combine the code before preprocessing, so you can use the linked Pen as a true dependency.\nJavaScript preprocessors can help make authoring JavaScript easier and more convenient.\nBabel includes JSX processing.\nAny URL's added here will be added as <script>\ns in order, and run before the JavaScript in the editor. You can use the URL of any other Pen and it will include the JavaScript from that Pen.\nYou can apply a script from anywhere on the web to your Pen. Just put a URL to it here and we'll add it, in the order you have them, before the JavaScript in the Pen itself.\nIf the script you link to has the file extension of a preprocessor, we'll attempt to process it before applying.\nYou can also link to another Pen here, and we'll pull the JavaScript from that Pen and include it. If it's using a matching preprocessor, we'll combine the code before preprocessing, so you can use the linked Pen as a true dependency.\nSearch for and use JavaScript packages from npm here. By selecting a package, an import\nstatement will be added to the top of the JavaScript editor for this package.\nUsing packages here is powered by esm.sh, which makes packages from npm not only available on a CDN, but prepares them for native JavaScript ESM usage.\nAll packages are different, so refer to their docs for how they work.\nIf you're using React / ReactDOM, make sure to turn on Babel for the JSX processing.\nPrivate Pens are hidden everywhere on CodePen, except to you. You can still share them and other people can see them, they just can't find them through searching or browsing.\nUpgrade to PROIf active, Pens will autosave every 30 seconds after being saved once.\nIf enabled, the preview panel updates automatically as you code. If disabled, use the \"Run\" button to update.\nIf enabled, your code will be formatted when you actively save your Pen. Note: your code becomes un-folded during formatting.\nVisit your global Editor Settings.\nTemplates are Pens that can be used to start other Pens quickly from the create menu. The new Pen will copy all the code and settings from the template and make a new Pen (that is not a fork). You can view all of your templates, or learn more in the documentation.\nScreenshots of Pens are shown in mobile browsers, RSS feeds, to users who chose images instead of iframes, and in social media sharing.\nPRO members can see and edit the Pen thumbnail here after the Pen has been saved.\n<main>\nthing the <main>\nthing.\nAlso see: Tab Triggers"
  },
  "jsfiddle.net": {
    "url": "https://jsfiddle.net/",
    "implementation_details": null
  },
  "codesandbox.io": {
    "url": "https://codesandbox.io/",
    "implementation_details": "per developer, per week\nin dev onboarding time\nof cloud workloads will be built and deployed using CDEs by 2026, according to Gartner\nGet always consistent development environments that boost productivity and empower collaboration.\nGet rid of slow build times and time lost in context-switching. Our powerful VMs run your code up to 200x faster than local and resume any project in 2 seconds.\nInstead of putting each developer's machine in the cloud, we run each branch on a centralized CDE that gives everyone the same experience.\nCodeSandbox is the only fully collaborative CDE. Your entire team can connect to the same environment and code live, together, anytime.\nWe are SOC 2 Type II compliant, ensuring the security of your code and data. You get flexible permissions, access control, security monitoring, private npm, and more.\nShorten the review cycle with an all-in-one platform for efficient code reviews.\nGet a cloud dev environment for every PR that starts in 2 seconds and integrates all code review tooling into a single platform.\nSave hours every week reviewing PRs. See the code, tests and a preview, make any necessary changes, and merge it.\nUsing accessible tooling such as our inspect tool, anyone can make commit changes with a few clicks.\nGet all the benefits of cloud development working flawlessly alongside your current setup.\nSwitch between VS Code and our web editor to keep coding and collaborating without skipping a beat.\nReview PRs in record time and get automatic deployment previews.\nWe use Dev Containers to pre-configure your environments with all the required tools, libraries and dependencies, so you can skip the setup and start coding."
  }
}